app/controllers/events_controller.rb

INSERT INTO `event_eventtypes` (`event_id`, `updated_at`, `eventtype_id`, `created_at`) VALUES(19, '2010-12-02 22:20:24', 9, '2010-12-02 22:20:24')
INSERT INTO `events` (`name`, `bin_lat`, `updated_at`, `end_at`, `cost`, `delta`, `start_at`, `description`, `bin_lng`, `owner_id`, `privacy`, `formality`, `location`, `created_at`) VALUES('House Party with the Cruiser', 0, '2010-12-02 22:24:32', '2010-12-17 00:00:00', 0, 1, '2010-12-16 20:00:00', 'Hang out with Tom Cruiser at his house and discuss scientology issues!', 0, 27, 'Public', 'Casual', '0,NaN', '2010-12-02 22:24:32')
---
  def create

    @event = Event.new(params[:event])

    #Create rows in EventEventtypes
    if params[:event_eventtype] != nil
      params[:event_eventtype].each { |p| @event.event_eventtypes << EventEventtype.new( p ) }

UPDATE `user_events` SET `event_id` = 18, `updated_at` = '2010-12-02 22:19:42' WHERE `id` = 20
---
    user_event = UserEvent.new
    user_event.user_id = current_user.id
    user_event.user_event_status = "ADMIN"
    return unless user_event.save

SELECT * FROM `events` WHERE (`events`.`id` = 4)
SELECT * FROM `user_events` WHERE (`user_events`.`event_id` = 18 AND `user_events`.`user_event_status` = 'ADMIN' AND `user_events`.`user_id` = 16) LIMIT 1
SELECT * FROM `event_ratings` WHERE (`event_ratings`.`event_id` = '18' AND `event_ratings`.`user_id` = 16)
---
  def show

    @event = Event.find(params[:id])

    # Check that user is allowed to view this event
    @admin_status = is_admin
    if current_user
      invite_status = UserEvent.find(:first, :conditions => {:event_id => @event.id, :user_id => current_user.id, :user_event_status => "INVITED"})
    else
      invite_status = nil
    end
    if @event.privacy == 'Public' or @admin_status or invite_status
      latlng = @event.location.split(',')
      @lat = latlng[0]
      @lng = latlng[1]

      if current_user
        @already_rated = false
        @user_rating = EventRating.all(:conditions => {:event_id => params[:id], :user_id => current_user.id})

SELECT * FROM `events` WHERE (`events`.`id` = 19)
SELECT * FROM `event_eventtypes` WHERE (`event_eventtypes`.event_id = 19 AND (`event_eventtypes`.`event_id` = '19'))
SELECT * FROM `eventtypes` WHERE (`eventtypes`.`id` = 9)
SELECT * FROM `event_photos` WHERE (`event_photos`.event_id = 19 AND (`event_photos`.`event_id` = '19'))
---
  def edit
    @event = Event.find(params[:id])
    @event_eventtype = @event.event_eventtypes.find(:all, :conditions => {:event_id => params[:id]})
    @event_photo = @event.event_photos.find(:all, :conditions => {:event_id => params[:id]})

SELECT * FROM `events` WHERE (`events`.`id` = 19)
UPDATE `events` SET `privacy` = 'Public', `updated_at` = '2010-12-02 22:44:23' WHERE `id` = 19
---
  def update
    @event = Event.find(params[:id])

    #Updated existing event types, photos, and invitations
    params[:event_eventtypes_update].each { |key, value| EventEventtype.find( key ).update_attributes(value)} if params[:event_eventtypes_update]

SELECT * FROM `friendships` WHERE (user_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
---
  def set_friends
    return if current_user.id =~ /[^\d]/
    friend_objs = Friendship.find(:all, :conditions => 'user_id = ' + current_user.id.to_s)
    @friends = {}
    friend_objs.each do |frnd|
      @friends[User.find(frnd.friend_id).login] = frnd.friend_id