app/controllers/eventtypes_controller.rb

SELECT * FROM `eventtypes` WHERE (LOWER(description) LIKE '%con%') ORDER BY description ASC LIMIT 8
---
  def select_for_event
    	@eventtypes = Eventtype.find(:all, :conditions => [ 'LOWER(description) LIKE ?', '%' + params[:q].downcase + '%' ],  :order => 'description ASC', :limit => 8)