app/controllers/friendships_controller.rb

  def create
    @friendship_a = current_user.friendships.build(:friend_id => params[:friend_id])

    @other_user = User.find(params[:friend_id])
    @friendship_b = @other_user.friendships.build(:friend_id => current_user.id)

    @pending_friend_request = PendingFriendRequest.find(:first, :conditions => ["user_id = ? AND requester_id = ?", current_user.id, params[:friend_id]])


    if (@friendship_a.save && @friendship_b.save && @pending_friend_request.destroy)
---
SELECT * FROM `users` WHERE (`users`.`id` = 27) LIMIT 1
SELECT * FROM `pending_friend_requests` WHERE (user_id = 27 AND requester_id = '28') LIMIT 1
DELETE FROM `pending_friend_requests` WHERE `id` = 1
INSERT INTO `friendships` (`updated_at`, `user_id`, `friend_id`, `created_at`) VALUES('2010-12-02 22:23:00', 27, 28, '2010-12-02 22:23:00')

  def display
    @results = Array.new()
    @user = current_user

    # Searching for an existing user's name or login
    if params[:search]
      query = params[:search][:query]
      @searchfor = query

      #Create an 'ids' array that will contain all the User ids that are returned from the search query
      #This method is from the Thinking-Sphinx plugin
      ids = Array.new( User.search_for_ids(query,:star => true) )

      #Find the User row/object associated with each user_id.
      #Add the User row/object to the @results array
      for user in User.find(ids)
---
SELECT * FROM `users` WHERE (`users`.`id` = 28) LIMIT 1