app/controllers/pending_friend_requests_controller.rb

  def create

    @user = User.find(params[:user_id])
    @pending_friend_request = @user.pending_friend_requests.build(:requester_id => current_user.id)

    if (@pending_friend_request.save )
---
SELECT * FROM `users` WHERE (`users`.`id` = 28) LIMIT 1
INSERT INTO `pending_friend_requests` (`updated_at`, `user_id`, `requester_id`, `created_at`) VALUES('2010-12-02 22:22:32', 27, 28, '2010-12-02 22:22:32')