app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `photo_file_name`, `photo_file_size`, `activated_at`, `crypted_password`, `delta`, `remember_token_expires_at`, `photo_updated_at`, `activation_code`, `password_reset_code`, `photo_content_type`, `remember_token`, `login`, `email`, `location`, `created_at`) VALUES('Lebron James', '8fb964c3f28a7784dba5ed494bae90227cf2216d', '2010-12-02 22:05:08', NULL, NULL, NULL, 'cc657e946fb5af3f48c01cad2bebc6f596b41d5e', 1, NULL, NULL, NULL, NULL, NULL, NULL, 'lebron', 'lebron@james.com', '49.26324913715629,-123.18403244018555', '2010-12-02 22:05:08')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `user_events` WHERE (`user_events`.`user_id` = 3)
---
    @user_events = Array.new

    #Search through the database and find the events, where there the current user is associated with
    user_event_rows = UserEvent.find_all_by_user_id(current_user.id)

UPDATE `users` SET `photo_updated_at` = '2010-12-02 22:05:36', `photo_content_type` = 'image/jpeg', `updated_at` = '2010-12-02 22:05:37', `photo_file_size` = 44018, `photo_file_name` = 'lebron1.jpg' WHERE `id` = 24
---
  def info
    @user = current_user
    puts(params[:user])
    if @user.update_attributes(params[:user])

SELECT * FROM `user_eventtypes`
DELETE FROM `user_eventtypes` WHERE `id` = 350
INSERT INTO `user_eventtypes` (`rating`, `updated_at`, `user_id`, `eventtype_id`, `created_at`) VALUES(NULL, '2010-12-02 09:10:57', 3, 1, '2010-12-02 09:10:57')
SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
UPDATE `users` SET `email` = 'cooper.jennl@gmail.com', `updated_at` = '2010-11-22 19:12:31' WHERE `id` = 1
---
  def update
    @user = current_user
    #get all use event tag objects from db for the logged in user
    @updated_user_event_tag = UserEventtype.find(:all, :conditions => :user_id == @user.id);
      @updated_user_event_tag.each do |event_tag|
        if (event_tag.eventtype_id != params[:tag_ids] && event_tag.user_id == @user.id)
            event_tag.destroy #destroy records that are not part of the update
        end
      end

      #put new records into db
      params[:tag_ids].each do |p|
          puts(p.to_s)
          @user.user_eventtypes << UserEventtype.new( :user_id => current_user.id, :eventtype_id=>p )
      end
      @updated_user_event_tag = UserEventtype.find(:all, :conditions => :user_id == @user.id);
      i = 0;
      @updated_tag_ids = {}
      @updated_user_event_tag.each do |e|
        @updated_tag_ids[i] = e.eventtype_id
        i = i+1
      end
      #notify user of success/failure of update
      if @user.update_attributes(params[:user])

UPDATE `users` SET `crypted_password` = 'f4e638094da6fbf7aaceb6f4c411600127080fdf', `updated_at` = '2010-12-02 22:45:29' WHERE `id` = 16
---
  def update_password
    @user = current_user
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
SELECT * FROM `user_events` WHERE (`user_events`.`user_id` = 3)
---
  def show
    @friend = User.find(params[:id])
    if current_user
      @user = current_user
    else
      redirect_to(login_path)
    end

    #If a user tries to view himself, it will redirect to his profile page
    if (@friend.id == current_user.id)
      redirect_to (profile_page_path)
    end

    #Information for Event Calendar
    if (params[:month] && params[:year])
      @month = params[:month].to_i
      @year = params[:year].to_i
    else
      time = Time.new
      @month = time.month
      @year = time.year
    end

    @shown_month = Date.civil(@year, @month)
    # To restrict what events are included in the result you can pass additional find options like this:
    # @event_strips = Event.event_strips_for_month(@shown_month, :include => :some_relation, :conditions => 'some_relations.some_column = true')

    #1.  Need to get all the Event ids that user is attending
    @user_events = Array.new

    user_event_rows = UserEvent.find_all_by_user_id(@friend.id)